from collections import Counter

def testing(subject, quesList, ansList, themeList):
    print('Тест з предмету', subject, 'для підготовки до ЗНО')
    pointsCounter=0
    themeAnsList=[]
    for i in range(10):
        print('Питання ', i+1, '. ', quesList[i], sep='')
        answer=input()
        if answer==ansList[i]:
            pointsCounter+=1
            themeAnsList.append(True)
            print('Відповідь правильна. Ваш поточний бал:', pointsCounter, '\n')
        else:
            themeAnsList.append(False)
            print('Відповідь неправильна. Правильна відповідь:', ansList[i])
            print('Ваш поточний бал:', pointsCounter, '\n')
    print('Ви закінчили тест з результатом', pointsCounter)
    if pointsCounter==10:
        print('Всі відповіді правильні.')
    elif pointsCounter==0:
        print('Всі відповіді неправильні. Підготуйтеся ще.')
    else:
        print('Не всі відповіді правильні.')
        themeList2=[]
        for z in themeList:
            themeList2.append(z)
        for j in range(9,-1,-1):
            if not themeAnsList[j]:
                themeList.pop(j)
        themeCount=dict(Counter(themeList))
        minList=[]
        for a in themeList2:
            if not a in themeList and not a in minList:
                minList.append(a)
        if len(minList)!=0:
            print('Радимо повоторити теми', minList)
        else:
            for k in themeCount:
                minTheme=k
                minValue=themeCount[k]
                break
            for l in themeCount:
                if themeCount[l] < minValue:
                    minValue=themeCount[l]
                    minTheme=l
            minThemeList=[minTheme]
            for m in themeCount:
                if themeCount[m]==minValue and not m==minTheme:
                    minThemeList.append(m)
            print('Радимо повоторити теми',minThemeList)

print('Добрий день, чи бажаєте пройти тест для підготовки до ЗНО? (y/n)')
yn=input()
jkl=True
while jkl:
    if yn=='y':
        nmb=True
        jkl=False
    elif yn=='n':
        nmb=False
        jkl=False
    else:
        print('Введіть y або n')
        yn=input()
while nmb:
    print('Який тест Ви бажаєте пройти? (1-математика, 2-українська мова, 3-англійська мова)')
    choose=int(input())
    if choose==1:
        testing("Математика", ["Скільки буде log2(8)?   а)1, б)2, в)3, г)4.", "Скільки буде log6(9)+log6(4)?   а)1, б)2, в)3, г)4.", "Що являє собою графік функції y=1/x?    а)пряма, б)парабола, в)гіпербола, г)експонента.", "Яка з наведених точок НЕ належить графіку функції y=x^2+7?   a)A(4,23), б)B(-3,-16), в)C(2,11), г(-1,8).", "Розв'язати рівняння: х^2-7х+6=0?   а)(2,-2), б)(1,-6), в)(8,2), г)(1,6).", "Розв'язати рівняння: х^2-5х+10=0?   а)немає коренів, б)(7,5), в)(2,3), г(1,-1).", "Яка з наведених рівностей виконується при будь-якому значенні кута а?   а)sin(a)+cos(a)=sin^2(a), б)cos^2(a)-sin^2(a)=cos(2a), в)sin(a)*cos(a)=tg(a), г)tg(a)=ctg(a)-1.", "Скільки буде sin(210°)?   а)2, б)1/2, в)-2, г)-1/2.", "Розв'язати рівняння: 2^x+5=37?   а)-5, б)5, в)-1/5, г)1/5.", "Розв'язати рівняння: 6^(х)+6^(х+1)=42?   а)1, б)2, в)3, г)4."], ['в', 'б', 'в', 'б', 'г', 'а', 'б', 'г', 'б', 'а'], ["Логарифми для цілих чисел", "Логарифми для цілих чисел", "Графіки функцій", "Графіки функцій", "Квадратні рівняння", "Квадратні рівняння", "Тригонометрія", "Тригонометрія", "Показникові рівняння", "Показникові рівняння"])
    elif choose==2:
        testing("Українська мова", ["В якому варіанті з наведених слово написано правильно:   а)расбити, б)росбити, в)розбити, г)разбити?", "В якому варіанті з наведених слово написано правильно:   а)зробити, б)сробити, в)з робити, г)с робити?", "Скільки ком треба ставити в реченні 'З його творів постає яскравий образ енциклопедично освіченої людини яка вболіває за майбутнє своїх нащадків і до порад якої завжди будуть дослухатися'?   а)1, б)2, в)3, г)4.", "Скільки ком треба ставити в реченні 'Прийшовши зі школи він почав робити домашнє завдання'?   а)1, б)2, в)3, г)4.", "Скільки відмін іменників існує в українській мові?   а)1, б)2, в)3, г)4.", "Які існують особливі форми дієслова?   а)прикметник і прислівник, б)дієприкметник і дієприслівник, в)неозначена і безособова, г)особові.", "Які виділяють головні члени речення?   а)додаток, означення, обставина, б)підмет і присудок, в)іменник і прикметник, г)дієслово і прислівник.", "Скільки головних членів в реченні 'Роблю це кожен день'?   а)0, б)1, в)2, г)3.", "Складними назвають речення, які:   а)мають другорядні члени, б)мають головні члени, в)мають дві граматичні основи, г)мають дві або більше граматичні основи.", "Складнопідрядними назвають речення, в яких:   а)одна частина залежить від іншої, б)частини рівноправні, в)другорядні члени залежать від головних, г)немає другорядних членів."], ['в', 'а', 'а', 'а', 'г', 'б', 'б', 'б', 'г', 'а'], ["Правопис префіксів на -з, -с", "Правопис префіксів на -з, -с", "Пунктуація", "Пунктуація", "Форми частин мови", "Форми частин мови", "Синтаксис", "Синтаксис", "Складні речення", "Складні речення"])
    elif choose == 3:
        testing("Англійська мова", ["В якому варіанті з наведених слово написано правильно:   а)don, б)done, в)do ne, г)doone?", "В якому варіанті з наведених слово написано правильно:   а)thought, б)thaught, в)thuoght, г)thougt?", "Як змінюється дієслово wear в минулому часі?   а)wear-wore-wore, б)wear-wore-worn, в)wear-ware-warn, г)wear-weared-weared.", "Як змінюється дієслово visit в минулому часі?  а)visit-visited-visited, б)visit-visit-visit, в)visit-visat-visut, г)visit-visited-visiten.", "Яке слово з наведених треба вставити в речення I ___ to do my homework?   а)will, б)need, в)must, г)have.", "Яке слово з наведених треба вставити в речення He is ___ to visit the museum? а)want, б)going, в)will, г)shall.", "Яке слово з наведених треба вставити в речення I do this ___ Mondays?   а)in, б)on, в)at, г)the.", "Яке слово з наведених треба вставити в речення He is coding ___ night? а)in, б)on, в)at, г)the.", "Де (з наведених варіантів) можливо вставити слово usually в реченні I go to school by bus   а)перед другим словом, б)перед третім, в)перед п'ятим, г)в кінці речення.", "Де (з наведених варіантів) можливо вставити слово often в реченні He doesn't watch TV? а)перед першим словом, б)перед другим, в)перед четвертим, г)в кінці речення."], ['б', 'а', 'б', 'а', 'г', 'б', 'б', 'в', 'а', 'б'], ["Past participle", "Past participle", "Regular and irregular verbs", "Regular and irregular verbs", "Modal phrases", "Modal phrases", "Prepositions in, on, at", "Prepositions in, on, at", "Adverbs of frequency", "Adverbs of frequency"])
    else:
        nmb=False